
title: CurrentVersion Autorun Keys Modification
ruletype: Sigma
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
  oscd.community, Tim Shelton, frack113 (split)
date: 2019/10/25
description: Detects modification of autostart extensibility point (ASEP) in registry.
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_10:
    Image: C:\Windows\system32\regsvr32.exe
  SELECTION_11:
    TargetObject: '*DropboxExt*'
  SELECTION_12:
    Details: '*A251-47B7-93E1-CDD82E34AF8B}'
  SELECTION_13:
    TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Run\Opera Browser Assistant'
  SELECTION_14:
    Details: C:\Program Files\Opera\assistant\browser_assistant.exe
  SELECTION_15:
    TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Run\iTunesHelper'
  SELECTION_16:
    Details: '"C:\Program Files\iTunes\iTunesHelper.exe"'
  SELECTION_17:
    TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\RunOnce\zoommsirepair'
  SELECTION_18:
    Details: '"C:\Program Files\Zoom\bin\installer.exe" /repair'
  SELECTION_19:
    TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Run\Greenshot'
  SELECTION_2:
    EventType: SetValue
  SELECTION_20:
    Details: C:\Program Files\Greenshot\Greenshot.exe
  SELECTION_21:
    TargetObject: '*\Software\Microsoft\Windows\CurrentVersion\Run\GoogleDriveFS'
  SELECTION_22:
    Details: C:\Program Files\Google\Drive File Stream\\*
  SELECTION_23:
    Details: '*\GoogleDriveFS.exe --startup_mode'
  SELECTION_24:
    TargetObject: '*GoogleDrive*'
  SELECTION_25:
    Details:
    - '{CFE8B367-77A7-41D7-9C90-75D16D7DC6B6}'
    - '{A8E52322-8734-481D-A7E2-27B309EF8D56}'
    - '{C973DA94-CBDF-4E77-81D1-E5B794FBD146}'
    - '{51EF1569-67EE-4AD6-9646-E726C3FFC8A2}'
  SELECTION_26:
    Details: C:\Windows\system32\cmd.exe /q /c rmdir /s /q "C:\Users\\*
  SELECTION_27:
    Details: '*\AppData\Local\Microsoft\OneDrive\\*'
  SELECTION_28:
    TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\RunOnce\{c60fd5ac-367d-4e3a-a975-f157502ac30a}'
  SELECTION_29:
    Details: '*\AppData\Local\Package Cache\{c60fd5ac-367d-4e3a-a975-f157502ac30a}\python*'
  SELECTION_3:
    TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion*'
  SELECTION_30:
    Details: '*.exe" /burn.runonce'
  SELECTION_31:
    Image:
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\\*
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\\*
  SELECTION_32:
    Image: '*\OfficeClickToRun.exe'
  SELECTION_33:
    Image: C:\Program Files\Windows Defender\MsMpEng.exe
  SELECTION_4:
    TargetObject:
    - '*\ShellServiceObjectDelayLoad*'
    - '*\Run\\*'
    - '*\RunOnce\\*'
    - '*\Policies\System\Shell*'
    - '*\Policies\Explorer\Run*'
    - '*\Group Policy\Scripts\Startup*'
    - '*\Group Policy\Scripts\Shutdown*'
    - '*\Group Policy\Scripts\Logon*'
    - '*\Group Policy\Scripts\Logoff*'
    - '*\Explorer\ShellServiceObjects*'
    - '*\Explorer\ShellIconOverlayIdentifiers*'
    - '*\Explorer\ShellExecuteHooks*'
    - '*\Explorer\SharedTaskScheduler*'
    - '*\Explorer\Browser Helper Objects*'
    - '*\Authentication\PLAP Providers*'
    - '*\Authentication\Credential Providers*'
    - '*\Authentication\Credential Provider Filters*'
  SELECTION_5:
    Details: (Empty)
  SELECTION_6:
    TargetObject: '*\NgcFirst\ConsecutiveSwitchCount'
  SELECTION_7:
    Image:
    - '*\AppData\Local\Microsoft\OneDrive\Update\OneDriveSetup.exe'
    - '*\AppData\Roaming\Spotify\Spotify.exe'
  SELECTION_8:
    Image:
    - C:\WINDOWS\system32\devicecensus.exe
    - C:\Program Files\Microsoft OneDrive\StandaloneUpdater\OneDriveSetup.exe
    - C:\Program Files\KeePass Password Safe 2\ShInstUtil.exe
    - C:\Program Files\Everything\Everything.exe
    - C:\Program Files (x86)\Microsoft Office\root\integration\integrator.exe
  SELECTION_9:
    Image:
    - C:\Program Files (x86)\Microsoft\EdgeUpdate\Install\\*
    - C:\Program Files (x86)\Microsoft\EdgeWebView\\*
    - C:\Program Files (x86)\Microsoft\Edge\Application\msedge.exe*
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3 and SELECTION_4) and  not
    ((SELECTION_5 or SELECTION_6 or SELECTION_7 or SELECTION_8) or (SELECTION_9) or
    (SELECTION_10 and SELECTION_11 and SELECTION_12) or (SELECTION_13 and SELECTION_14)
    or (SELECTION_15 and SELECTION_16) or (SELECTION_17 and SELECTION_18) or (SELECTION_19
    and SELECTION_20) or (SELECTION_21 and SELECTION_22 and SELECTION_23) or (SELECTION_24
    and SELECTION_25) or (SELECTION_26 and SELECTION_27) or (SELECTION_28 and SELECTION_29
    and SELECTION_30) or (SELECTION_31 and SELECTION_32) or (SELECTION_33)))
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
  keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
fields:
- SecurityID
- ObjectName
- OldValueType
- NewValueType
id: 20f0ee37-5942-4e45-b7d5-c5b5db9df5cd
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1547.001/T1547.001.md
- https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
related:
- id: 17f878b8-9968-4578-b814-c4217fc5768c
  type: derived
status: experimental
tags:
- attack.persistence
- attack.t1547.001
